Autodesk.Revit.DB.IOnLocalLinkSharedCoordinatesSavedCallback.OnLocalLinkSharedCoordinatesSaved(Autodesk.Revit.DB.ExternalResourceReference)
Revit will call this method whenever shared coordinates
changes are saved to a linked document provided by an
IExternalResourceServer. This call is a notification
to the server provider that one of their Revit links has
changed locally, and they should upload the new version
back to their server.
changedResource:
The ExternalResourceReference whose shared coordinates have been saved.
Since:
2015

Autodesk.Revit.DB.IOnLocalLinkSharedCoordinatesSavedCallback
A callback for notifying an IExternalResourceServer that
shared coordinates changes have been saved back to one
of the Revit links provided by that server.
Remarks:
Revit will call OnLocalLinkSharedCoordinatesSaved whenever
shared coordinates changes are saved to a linked document
which is provided by an external server. This is a notification
to the server provider so they can copy the updated link
back up to their server.
Since:
2015